{
    "branches": [
        {
            "name": "Information Technology",
            "icon": "desktop",
            "color": "#FF9800",
            "gradientColors": [
                "#FF9800",
                "#FFB74D"
            ],
            "description": "Software development, networking, and data management",
            "semesters": [
                {
                    "id": 3,
                    "name": "Semester 3",
                    "subjectsCount": 5,
                    "credits": 0,
                    "subjects": [
                        {
                            "name": "Discrete Mathematics",
                            "course_code": null,
                            "credits": 0,
                            "type": "Core Subject",
                            "syllabus": {
                                "courseObjectives": [
                                    "Use mathematically correct terminology and notation.",
                                    "Construct correct direct and indirect proofs.",
                                    "Use division into cases in a proof.",
                                    "Use counterexamples.",
                                    "Apply logical reasoning to solve a variety of problems."
                                ],
                                "learningOutcomes": [
                                    "For a given logic sentence express it in terms of predicates, quantifiers, and logical connectives.",
                                    "For a given problem, derive the solution using deductive logic and prove the solution based on logical inference.",
                                    "For a given mathematical problem, classify its algebraic structure.",
                                    "Evaluate Boolean functions and simplify expressions using the properties of Boolean algebra",
                                    "Develop the given problem as graph networks and solve with techniques of graph theory."
                                ],
                                "courseContent": "# Course Content\n\n## Module 1: Lecture 6\n- Sets, Relation and Function: Operations and Laws of Sets, Cartesian Products, Binary Relation, Partial Ordering Relation, Equivalence Relation, Image of a Set, Sum and Product of Functions, Bijective functions, Inverse and Composite Function, Size of a Set, Finite and infinite Sets, Countable and uncountable Sets, Cantor’s diagonal argument and The Power Set theorem, Schroeder-Bernstein theorem.\n\n## Module 2: Lecture 8\n- Principles of Mathematical Induction: The Well-Ordering Principle, Recursive definition, The Division algorithm: Prime Numbers, The Greatest Common Divisor: Euclidean Algorithm, The Fundamental Theorem of Arithmetic.\n- Basic counting techniques-inclusion and exclusion, pigeon-hole principle, permutation and combination.\n\n## Module 3: Lecture 8\n- Propositional Logic: Syntax, Semantics, Validity and Satisfiability, Basic Connectives and Truth Tables, Logical Equivalence: The Laws of Logic, Logical Implication, Rules of Inference, The use of Quantifiers. Proof Techniques: Some Terminology, Proof Methods and Strategies, Forward Proof, Proof by Contradiction, Proof by Contraposition, Proof of Necessity and Sufficiency.\n\n## Module 4: Lecture 8\n- Algebraic Structures and Morphism: Algebraic Structures with one Binary Operation, Semi Groups, Monoids, Groups, Congruence Relation and Quotient Structures, Free and Cyclic Monoids and Groups, Permutation Groups, Substructures, Normal Subgroups, Algebraic Structures with two Binary Operation, Rings, Integral Domain and Fields. Boolean Algebra and Boolean Ring, Identities of Boolean Algebra, Duality, Representation of Boolean Function, Disjunctive and Conjunctive Normal Form\n\n## Module 5: Lecture 10\n- Graphs and Trees: Graphs and their properties, Degree, Connectivity, Path, Cycle, Sub Graph, Isomorphism, Eulerian and Hamiltonian Walks, Graph Coloring, Coloring maps, Planar Graphs, Coloring Vertices, Coloring Edges, List Coloring, Perfect Graph, definition properties and Example, rooted trees, trees and sorting, weighted trees and prefix codes, Bi-connected component and Articulation Points, Shortest distances.",
                                "referenceBooks": [
                                    "Kenneth H. Rosen, Discrete Mathematics and its Applications, Tata McGraw –Hill",
                                    "Susanna S. Epp, Discrete Mathematics with Applications,4th edition, Wadsworth Publishing Co.Inc.",
                                    "C L Liu and D P Mohapatra, Elements of Discrete Mathematics A Computer Oriented Approach, 3rd Edition by, Tata McGraw –Hill."
                                ],
                                "assessmentMethods": []
                            }
                        },
                        {
                            "name": "Data Structure and Algorithms",
                            "course_code": null,
                            "credits": 0,
                            "type": "Core Subject",
                            "syllabus": {
                                "courseObjectives": [],
                                "learningOutcomes": [],
                                "courseContent": null,
                                "referenceBooks": [],
                                "assessmentMethods": []
                            }
                        },
                        {
                            "name": "Digital Electronics",
                            "course_code": null,
                            "credits": 0,
                            "type": "Core Subject",
                            "syllabus": {
                                "courseObjectives": [],
                                "learningOutcomes": [],
                                "courseContent": null,
                                "referenceBooks": [],
                                "assessmentMethods": []
                            }
                        },
                        {
                            "name": "Object Oriented Programming using C++",
                            "course_code": null,
                            "credits": 0,
                            "type": "Core Subject",
                            "syllabus": {
                                "courseObjectives": [],
                                "learningOutcomes": [],
                                "courseContent": null,
                                "referenceBooks": [],
                                "assessmentMethods": []
                            }
                        },
                        {
                            "name": "Mathematics -III (Differential Calculus)",
                            "course_code": null,
                            "credits": 0,
                            "type": "Core Subject",
                            "syllabus": {
                                "courseObjectives": [],
                                "learningOutcomes": [],
                                "courseContent": null,
                                "referenceBooks": [],
                                "assessmentMethods": []
                            }
                        }
                    ]
                }
            ]
        }
    ],
    "metadata": {
        "academicYear": "2024-2025",
        "appName": "Engineering Hub",
        "updatedAt": "2025-02-26"
    }
}